evaluation_tests/test2_webserver/tc2_js_curve_c16/step09_rps24__assets_index_u5eV4oN_js.txt
Running 30s test @ http://54.235.233.71/assets/index-u5eV4oN_.js
  4 threads and 16 connections
  Thread calibration: mean lat.: 1731.436ms, rate sampling interval: 6651ms
  Thread calibration: mean lat.: 1270.287ms, rate sampling interval: 4345ms
  Thread calibration: mean lat.: 1073.067ms, rate sampling interval: 4175ms
  Thread calibration: mean lat.: 1333.128ms, rate sampling interval: 4440ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.01s     2.08s    8.70s    66.99%
    Req/Sec     4.67      0.79     6.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    3.89s 
 75.000%    5.52s 
 90.000%    6.88s 
 99.000%    8.56s 
 99.900%    8.71s 
 99.990%    8.71s 
 99.999%    8.71s 
100.000%    8.71s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

     378.111     0.000000            1         1.00
     973.823     0.100000           42         1.11
    2334.719     0.200000           83         1.25
    2859.007     0.300000          124         1.43
    3244.031     0.400000          165         1.67
    3887.103     0.500000          206         2.00
    4268.031     0.550000          228         2.22
    4550.655     0.600000          248         2.50
    4890.623     0.650000          269         2.86
    5210.111     0.700000          289         3.33
    5517.311     0.750000          309         4.00
    5586.943     0.775000          320         4.44
    5697.535     0.800000          330         5.00
    5939.199     0.825000          340         5.71
    6365.183     0.850000          351         6.67
    6705.151     0.875000          361         8.00
    6791.167     0.887500          366         8.89
    6877.183     0.900000          371        10.00
    6918.143     0.912500          376        11.43
    7045.119     0.925000          383        13.33
    7163.903     0.937500          387        16.00
    7274.495     0.943750          389        17.78
    7786.495     0.950000          392        20.00
    7815.167     0.956250          394        22.86
    8011.775     0.962500          397        26.67
    8179.711     0.968750          400        32.00
    8204.287     0.971875          401        35.56
    8388.607     0.975000          402        40.00
    8421.375     0.978125          403        45.71
    8536.063     0.981250          405        53.33
    8552.447     0.984375          406        64.00
    8560.639     0.985938          408        71.11
    8560.639     0.987500          408        80.00
    8560.639     0.989062          408        91.43
    8593.407     0.990625          409       106.67
    8593.407     0.992188          409       128.00
    8658.943     0.992969          410       142.22
    8658.943     0.993750          410       160.00
    8658.943     0.994531          410       182.86
    8691.711     0.995313          411       213.33
    8691.711     0.996094          411       256.00
    8691.711     0.996484          411       284.44
    8691.711     0.996875          411       320.00
    8691.711     0.997266          411       365.71
    8708.095     0.997656          412       426.67
    8708.095     1.000000          412          inf
#[Mean    =     4005.893, StdDeviation   =     2075.110]
#[Max     =     8699.904, Total count    =          412]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  604 requests in 30.02s, 124.11MB read
Requests/sec:     20.12
Transfer/sec:      4.13MB