evaluation_tests/test2_webserver/tc2_js_curve_c16/step10_rps26__assets_index_u5eV4oN_js.txt
Running 30s test @ http://54.235.233.71/assets/index-u5eV4oN_.js
  4 threads and 16 connections
  Thread calibration: mean lat.: 778.433ms, rate sampling interval: 2117ms
  Thread calibration: mean lat.: 1238.402ms, rate sampling interval: 4134ms
  Thread calibration: mean lat.: 1290.656ms, rate sampling interval: 5234ms
  Thread calibration: mean lat.: 1422.831ms, rate sampling interval: 4902ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.40s     1.78s    9.12s    68.87%
    Req/Sec     5.35      0.79     7.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.85s 
 75.000%    3.47s 
 90.000%    5.44s 
 99.000%    7.41s 
 99.900%    9.13s 
 99.990%    9.13s 
 99.999%    9.13s 
100.000%    9.13s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

     291.327     0.000000            1         1.00
     553.471     0.100000           47         1.11
     791.551     0.200000           94         1.25
    1240.063     0.300000          141         1.43
    1541.119     0.400000          188         1.67
    1850.367     0.500000          235         2.00
    1953.791     0.550000          258         2.22
    2199.551     0.600000          282         2.50
    2674.687     0.650000          305         2.86
    3192.831     0.700000          329         3.33
    3469.311     0.750000          352         4.00
    3563.519     0.775000          364         4.44
    3661.823     0.800000          376         5.00
    3860.479     0.825000          387         5.71
    4177.919     0.850000          399         6.67
    4915.199     0.875000          411         8.00
    5148.671     0.887500          417         8.89
    5447.679     0.900000          424        10.00
    5480.447     0.912500          428        11.43
    5660.671     0.925000          434        13.33
    5791.743     0.937500          441        16.00
    5873.663     0.943750          443        17.78
    5963.775     0.950000          446        20.00
    6004.735     0.956250          449        22.86
    6111.231     0.962500          452        26.67
    6500.351     0.968750          455        32.00
    6529.023     0.971875          456        35.56
    6684.671     0.975000          458        40.00
    6795.263     0.978125          459        45.71
    7020.543     0.981250          461        53.33
    7073.791     0.984375          462        64.00
    7155.711     0.985938          463        71.11
    7413.759     0.987500          464        80.00
    7413.759     0.989062          464        91.43
    7602.175     0.990625          465       106.67
    7925.759     0.992188          466       128.00
    7925.759     0.992969          466       142.22
    8142.847     0.993750          467       160.00
    8142.847     0.994531          467       182.86
    8142.847     0.995313          467       213.33
    8667.135     0.996094          468       256.00
    8667.135     0.996484          468       284.44
    8667.135     0.996875          468       320.00
    8667.135     0.997266          468       365.71
    8667.135     0.997656          468       426.67
    9125.887     0.998047          469       512.00
    9125.887     1.000000          469          inf
#[Mean    =     2395.670, StdDeviation   =     1777.559]
#[Max     =     9117.696, Total count    =          469]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  689 requests in 30.02s, 141.60MB read
Requests/sec:     22.95
Transfer/sec:      4.72MB