evaluation_tests/test2_webserver/tc2_js_curve_c16/step11_rps28__assets_index_u5eV4oN_js.txt
Running 30s test @ http://54.235.233.71/assets/index-u5eV4oN_.js
  4 threads and 16 connections
  Thread calibration: mean lat.: 1770.152ms, rate sampling interval: 9560ms
  Thread calibration: mean lat.: 2514.068ms, rate sampling interval: 9166ms
  Thread calibration: mean lat.: 1902.203ms, rate sampling interval: 7106ms
  Thread calibration: mean lat.: 1697.579ms, rate sampling interval: 7675ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.31s     3.44s   12.94s    58.30%
    Req/Sec     5.88      0.78     7.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    3.76s 
 75.000%    7.16s 
 90.000%    9.55s 
 99.000%   11.89s 
 99.900%   12.85s 
 99.990%   12.95s 
 99.999%   12.95s 
100.000%   12.95s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

     274.687     0.000000            1         1.00
     477.439     0.100000           51         1.11
     836.607     0.200000          102         1.25
    1379.327     0.300000          152         1.43
    2308.095     0.400000          203         1.67
    3758.079     0.500000          253         2.00
    4546.559     0.550000          279         2.22
    5099.519     0.600000          304         2.50
    5480.447     0.650000          330         2.86
    6057.983     0.700000          355         3.33
    7155.711     0.750000          380         4.00
    7393.279     0.775000          393         4.44
    7790.591     0.800000          405         5.00
    8364.031     0.825000          418         5.71
    8552.447     0.850000          431         6.67
    9199.615     0.875000          443         8.00
    9437.183     0.887500          450         8.89
    9560.063     0.900000          456        10.00
    9822.207     0.912500          462        11.43
    9904.127     0.925000          469        13.33
   10051.583     0.937500          475        16.00
   10280.959     0.943750          478        17.78
   10371.071     0.950000          481        20.00
   10493.951     0.956250          484        22.86
   10657.791     0.962500          488        26.67
   10829.823     0.968750          491        32.00
   10854.399     0.971875          492        35.56
   10993.663     0.975000          494        40.00
   11165.695     0.978125          495        45.71
   11313.151     0.981250          498        53.33
   11476.991     0.984375          499        64.00
   11476.991     0.985938          499        71.11
   11517.951     0.987500          500        80.00
   11894.783     0.989062          501        91.43
   12181.503     0.990625          502       106.67
   12476.415     0.992188          503       128.00
   12476.415     0.992969          503       142.22
   12476.415     0.993750          503       160.00
   12705.791     0.994531          504       182.86
   12705.791     0.995313          504       213.33
   12853.247     0.996094          505       256.00
   12853.247     0.996484          505       284.44
   12853.247     0.996875          505       320.00
   12853.247     0.997266          505       365.71
   12853.247     0.997656          505       426.67
   12951.551     0.998047          506       512.00
   12951.551     1.000000          506          inf
#[Mean    =     4305.654, StdDeviation   =     3439.860]
#[Max     =    12943.360, Total count    =          506]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  696 requests in 30.02s, 143.21MB read
Requests/sec:     23.18
Transfer/sec:      4.77MB