evaluation_tests/test2_webserver/tc2_js_curve_c16/step12_rps30__assets_index_u5eV4oN_js.txt
Running 30s test @ http://54.235.233.71/assets/index-u5eV4oN_.js
  4 threads and 16 connections
  Thread calibration: mean lat.: 731.740ms, rate sampling interval: 2150ms
  Thread calibration: mean lat.: 1035.062ms, rate sampling interval: 4448ms
  Thread calibration: mean lat.: 912.246ms, rate sampling interval: 3082ms
  Thread calibration: mean lat.: 948.878ms, rate sampling interval: 3897ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.90s     2.22s   13.30s    66.67%
    Req/Sec     5.96      1.02     8.00     91.67%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.51s 
 75.000%    4.37s 
 90.000%    5.87s 
 99.000%    8.73s 
 99.900%   12.99s 
 99.990%   13.31s 
 99.999%   13.31s 
100.000%   13.31s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

     273.407     0.000000            1         1.00
     555.007     0.100000           52         1.11
     763.903     0.200000          104         1.25
    1141.759     0.300000          156         1.43
    1793.023     0.400000          208         1.67
    2506.751     0.500000          260         2.00
    2820.095     0.550000          286         2.22
    3090.431     0.600000          312         2.50
    3414.015     0.650000          338         2.86
    3940.351     0.700000          364         3.33
    4419.583     0.750000          390         4.00
    4710.399     0.775000          403         4.44
    4907.007     0.800000          416         5.00
    5107.711     0.825000          429         5.71
    5357.567     0.850000          442         6.67
    5713.919     0.875000          455         8.00
    5804.031     0.887500          461         8.89
    5873.663     0.900000          468        10.00
    5935.103     0.912500          474        11.43
    6053.887     0.925000          481        13.33
    6254.591     0.937500          487        16.00
    6332.415     0.943750          490        17.78
    6569.983     0.950000          494        20.00
    6713.343     0.956250          497        22.86
    7143.423     0.962500          500        26.67
    7548.927     0.968750          503        32.00
    7626.751     0.971875          505        35.56
    7819.263     0.975000          507        40.00
    7929.855     0.978125          508        45.71
    8302.591     0.981250          510        53.33
    8327.167     0.984375          512        64.00
    8327.167     0.985938          512        71.11
    8396.799     0.987500          513        80.00
    8732.671     0.989062          514        91.43
   10657.791     0.990625          515       106.67
   10657.791     0.992188          515       128.00
   11567.103     0.992969          516       142.22
   11567.103     0.993750          516       160.00
   12460.031     0.994531          517       182.86
   12460.031     0.995313          517       213.33
   12460.031     0.996094          517       256.00
   12992.511     0.996484          518       284.44
   12992.511     0.996875          518       320.00
   12992.511     0.997266          518       365.71
   12992.511     0.997656          518       426.67
   12992.511     0.998047          518       512.00
   13311.999     0.998242          519       568.89
   13311.999     1.000000          519          inf
#[Mean    =     2897.183, StdDeviation   =     2222.767]
#[Max     =    13303.808, Total count    =          519]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  777 requests in 30.02s, 159.77MB read
  Socket errors: connect 0, read 0, write 0, timeout 1
Requests/sec:     25.88
Transfer/sec:      5.32MB